#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
google_service_account.minecraft: Refreshing state... [id=projects/spatial-box-123118/serviceAccounts/minecraft@spatial-box-123118.iam.gserviceaccount.com]
google_compute_disk.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/disks/minecraft]
google_compute_address.minecraft: Refreshing state... [id=projects/spatial-box-123118/regions/us-east1/addresses/minecraft-ip]
google_compute_network.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/networks/minecraft]
google_compute_firewall.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/firewalls/minecraft]
google_compute_instance_template.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210214000042785600000001]
google_compute_instance_group_manager.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/instanceGroupManagers/minecraft]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_disk_resource_policy_attachment.backup_policy_attachment will be created
  + resource "google_compute_disk_resource_policy_attachment" "backup_policy_attachment" {
      + disk    = "minecraft"
      + id      = (known after apply)
      + name    = "minecraft-backup-policy"
      + project = (known after apply)
      + zone    = "us-east1-b"
    }

  # google_compute_resource_policy.backup_policy will be created
  + resource "google_compute_resource_policy" "backup_policy" {
      + id        = (known after apply)
      + name      = "minecraft-backup-policy"
      + project   = (known after apply)
      + region    = "us-east1"
      + self_link = (known after apply)

      + snapshot_schedule_policy {
          + retention_policy {
              + max_retention_days    = 7
              + on_source_disk_delete = "KEEP_AUTO_SNAPSHOTS"
            }

          + schedule {
              + daily_schedule {
                  + days_in_cycle = 1
                  + start_time    = "04:00"
                }
            }

          + snapshot_properties {
              + storage_locations = [
                  + "us",
                ]
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*